mrdude2478/Waveshare-ESP32-S3-Touch-AMOLED-1.8v1-NSW-Payload-Injector/src/FtpServer.cpp
/*
 * FtpServer Arduino, esp8266 and esp32 library for Ftp Server
 * Derived form Jean-Michel Gallego version
 *
 * AUTHOR:  Renzo Mischianti
 *
 * https://www.mischianti.org/2020/02/08/ftp-server-on-esp8266-and-esp32
 *
 *
 * Use Ethernet library
 * 
 * Commands implemented: 
 *   USER, PASS, AUTH (AUTH only return 'not implemented' code)
 *   CDUP, CWD, PWD, QUIT, NOOP
 *   MODE, PASV, PORT, STRU, TYPE
 *   ABOR, DELE, LIST, NLST, MLST, MLSD
 *   APPE, RETR, STOR
 *   MKD,  RMD
 *   RNTO, RNFR
 *   MDTM, MFMT
 *   FEAT, SIZE
 *   SITE FREE
 *   SYST
 *   HELP
 *
 * Tested with those clients:
 *   under Windows:
 *     FTP Rush
 *     Filezilla
 *     WinSCP
 *     NcFTP, ncftpget, ncftpput
 *     Firefox
 *     command line ftp.exe
 *   under Ubuntu:
 *     gFTP
 *     Filezilla
 *     NcFTP, ncftpget, ncftpput
 *     lftp
 *     ftp
 *     Firefox
 *   under Android:
 *     AndFTP
 *     FTP Express
 *     Firefox
 *   with a second Arduino and sketch of SurferTim at
 *     http://playground.arduino.cc/Code/FTP
 * 
 */

#include "../include/FtpServer.h"
#include <SD.h>

fs::FS* currentFS = &FFat; // Default to FFat
uint8_t selectedStorageType = 0;
	
void FtpServer::setFileSystem(fs::FS& fs) {
    currentFS = &fs;
}

void FtpServer::setStorageType(uint8_t storageType) {
    selectedStorageType = storageType;
    DEBUG_PRINT(F("Storage type set to: "));
    DEBUG_PRINTLN(storageType);
}

void FtpServer::updateFileSystem() {
    if (selectedStorageType == STORAGE_SD) {
        currentFS = &SD; // Default to S
        DEBUG_PRINTLN(F("File system switched to SD"));
    } else if (selectedStorageType == STORAGE_FFAT) {
        currentFS = &FFat; // Default to FFat
        DEBUG_PRINTLN(F("File system switched to FFAT"));
    } else {
        // Fallback to default storage type for the platform
        #if defined(ESP32)
            currentFS = &FFat; // Default to FFat
        #elif defined(ESP8266)
            currentFS = &LittleFS; // Default for ESP8266
        #else
            currentFS = &SPIFFS; // Default for other platforms
        #endif
        DEBUG_PRINTLN(F("File system set to default"));
    }
    // Reset current directory to root to ensure valid state
    strcpy(cwdName, "/");
}

bool shouldSkipFile(const String& filename) {
    // Skip config.json in any directory
    String baseName = filename;
    baseName.toLowerCase();
    if (baseName.endsWith("/config.json")) return true;
    
    // Extract just the filename part
    int lastSlash = baseName.lastIndexOf('/');
    if (lastSlash >= 0) {
        baseName = baseName.substring(lastSlash + 1);
    }
    
    return baseName == "config.json";
}

FtpServer::FtpServer( uint16_t _cmdPort, uint16_t _pasvPort )
         : ftpServer( _cmdPort ), dataServer( _pasvPort )
{
  cmdPort = _cmdPort;
  pasvPort = _pasvPort;

  millisDelay = 0;
  nbMatch = 0;
  iCL = 0;
  

  iniVariables();
}

void FtpServer::begin( const char * _user, const char * _pass, const char * _welcomeMessage )
{
    // Debug output for network and storage type
    DEBUG_PRINTLN(F("Initializing FTP server..."));
    DEBUG_PRINT(F("Network Type: "));
    #if FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266_ASYNC
        DEBUG_PRINTLN(F("ESP8266 Async"));
    #elif FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266
        DEBUG_PRINTLN(F("ESP8266 Standard"));
    #elif FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266_242
        DEBUG_PRINTLN(F("ESP8266 Pre-2.4.2"));
    #elif FTP_SERVER_NETWORK_TYPE == NETWORK_ESP32
        DEBUG_PRINTLN(F("ESP32 WiFi"));
    #elif FTP_SERVER_NETWORK_TYPE == NETWORK_ESP32_ETH
        DEBUG_PRINTLN(F("ESP32 Ethernet"));
    #elif FTP_SERVER_NETWORK_TYPE == NETWORK_WiFiNINA
        DEBUG_PRINTLN(F("WiFiNINA"));
    #elif FTP_SERVER_NETWORK_TYPE == NETWORK_SEEED_RTL8720DN
        DEBUG_PRINTLN(F("Seeed RTL8720DN"));
    #else
        DEBUG_PRINTLN(F("Unknown Network Type"));
    #endif

    DEBUG_PRINT(F("Storage Type: "));
    #if STORAGE_TYPE == STORAGE_SPIFFS
        DEBUG_PRINTLN(F("SPIFFS"));
    #elif STORAGE_TYPE == STORAGE_FFAT
        DEBUG_PRINTLN(F("FFAT"));
    #elif STORAGE_TYPE == STORAGE_LITTLEFS
        DEBUG_PRINTLN(F("LITTLEFS"));
    #elif STORAGE_TYPE == STORAGE_SD
        DEBUG_PRINTLN(F("SD"));
    #elif STORAGE_TYPE == STORAGE_SD_MMC
        DEBUG_PRINTLN(F("SD_MMC"));
    #elif STORAGE_TYPE == STORAGE_SEEED_SD
        DEBUG_PRINTLN(F("Seeed SD"));
    #elif STORAGE_TYPE == STORAGE_SDFAT1
        DEBUG_PRINTLN(F("SdFat1"));
    #elif STORAGE_TYPE == STORAGE_SDFAT2
        DEBUG_PRINTLN(F("SdFat2"));
    #elif STORAGE_TYPE == STORAGE_SPIFM
        DEBUG_PRINTLN(F("SPI Flash Memory"));
    #elif STORAGE_TYPE == STORAGE_FATFS
        DEBUG_PRINTLN(F("FATFS"));
    #else
        DEBUG_PRINTLN(F("Unknown Storage Type"));
    #endif

	if ( strcmp( _user, "anonymous" ) != 0) {
		DEBUG_PRINTLN(F("NOT ANONYMOUS"));
		DEBUG_PRINTLN(_user);
		this->anonymousConnection = false; // needed to reset after end of anonymnous and begin of not anonymous
	}
  // Tells the ftp server to begin listening for incoming connection
  ftpServer.begin();
  #if (defined(ESP8266) && (FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266_ASYNC || FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266 || FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266_242)) || defined(ARDUINO_ARCH_RP2040) || FTP_SERVER_NETWORK_TYPE_SELECTED == NETWORK_SEEED_RTL8720DN
  ftpServer.setNoDelay( true );
  #endif
//  localIp = _localIP == FTP_NULLIP() || (uint32_t) _localIP == 0 ? NET_CLASS.localIP() : _localIP ;
  localIp = NET_CLASS.localIP(); //_localIP == FTP_NULLIP() || (uint32_t) _localIP == 0 ? NET_CLASS.localIP() : _localIP ;
//  strcpy( user, FTP_USER );
//  strcpy( pass, FTP_PASS );
  if( strlen( _user ) > 0 && strlen( _user ) < FTP_CRED_SIZE ) {
    //strcpy( user, _user );
	  this->user = _user;
  }
  if( strlen( _pass ) > 0 && strlen( _pass ) < FTP_CRED_SIZE ) {
//    strcpy( pass, _pass );
	  this->pass = _pass;
  }
//  strcpy(_welcomeMessage, welcomeMessage);

  this->welcomeMessage = _welcomeMessage;

  dataServer.begin();
#if (defined(ESP8266) && (FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266_ASYNC || FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266 || FTP_SERVER_NETWORK_TYPE == NETWORK_ESP8266_242)) || defined(ARDUINO_ARCH_RP2040) || FTP_SERVER_NETWORK_TYPE_SELECTED == NETWORK_SEEED_RTL8720DN
  dataServer.setNoDelay( true );
#endif

  millisDelay = 0;
  cmdStage = FTP_Stop;
  iniVariables();
}

