mrdude2478/Waveshare-ESP32-S3-Touch-AMOLED-1.8v1-NSW-Payload-Injector/src/FtpServer.cpp
		  if (FtpServer::_transferCallback) {

			  FtpServer::_transferCallback(FTP_UPLOAD_START, parameter, bytesTransfered);
		  }

      }
    }
  }
  ///////////////////////////////////////
  //                                   //
  //         REST COMMAND              //
  //                                   //
  ///////////////////////////////////////

  // REST - Restart file transfer at a specific byte offset
  else if (CommandIs("REST")) {
      if (haveParameter()) {
          restartPos = atol(parameter); // Parse the byte offset
          client.print(F("350 Restarting at "));
          client.print(restartPos);
          client.println(F(". Ready to resume transfer."));
      } else {
          client.println(F("501 Syntax error in parameters or arguments."));
      }
  }
  // STAT
  // Display status information about a specific file or the FTP server.
  else if (CommandIs("STAT")) {
      if (haveParameter()) {
          char path[FTP_CWD_SIZE];
          if (makeExistsPath(path)) {
              client.println(F("211-File status:"));
              client.print(F(" Size: "));
              client.println(fileSize(file));
              client.println(F("211 End of status."));
          } else {
              client.println(F("450 File not found."));
          }
      } else {
          client.println(F("211-Server status:"));
          client.print(F(" Current directory: "));
          client.println(cwdName);
          client.println(F("211 End of status."));
      }
  }
  // ALLO
  else if (CommandIs("ALLO")) {
      if (haveParameter()) {
          client.println(F("202 ALLO command ignored; allocation is not necessary."));
      } else {
          client.println(F("501 Syntax error in parameters or arguments."));
      }
  }

  //
  //  MKD - Make Directory
  //
  else if( CommandIs( "MKD" ))
  {
    char path[ FTP_CWD_SIZE ];
    if( haveParameter() && makePath( path ))
    {
      if( exists( path )) {
    	  client.print( F("521 \"") ); client.print( parameter ); client.println( F("\" directory already exists") );
      } else
      {
    	  DEBUG_PRINT( F(" Creating directory ")); DEBUG_PRINTLN( parameter );

#if STORAGE_TYPE != STORAGE_SPIFFS
        if( makeDir( path )) {
        	client.print( F("257 \"") ); client.print( parameter ); client.print( F("\"") ); client.println( F(" created") );
        } else {
#endif
        	client.print( F("550 Can't create \"") ); client.print( parameter ); client.println( F("\"") );
#if STORAGE_TYPE != STORAGE_SPIFFS
        }
#endif
      }
    }
  }
  //
  //  RMD - Remove a Directory 
  //
  else if( CommandIs( "RMD" ))
  {
    char path[ FTP_CWD_SIZE ];
    if( haveParameter() && makeExistsPath( path )) {
      if( removeDir( path ))
      {
    	  DEBUG_PRINT( F(" Deleting ") ); DEBUG_PRINTLN( path );

    	  client.print( F("250 \"") ); client.print( parameter ); client.println( F("\" deleted") );
      }
      else {
    	  client.print( F("550 Can't remove \"") ); client.print( parameter ); client.println( F("\". Directory not empty?") );
      }
    }
  }
  //
  //  RNFR - Rename From 
  //
  else if( CommandIs( "RNFR" ))
  {
    rnfrName[ 0 ] = 0;
    if( haveParameter() && makeExistsPath( rnfrName ))
    {
    	DEBUG_PRINT( F(" Ready for renaming ") ); DEBUG_PRINTLN( rnfrName );

      client.println(F("350 RNFR accepted - file exists, ready for destination") );
      rnfrCmd = true;
    }
  }
  //
  //  RNTO - Rename To 
  //
  else if( CommandIs( "RNTO" ))
  {
    char path[ FTP_CWD_SIZE ];
    char dirp[ FTP_FIL_SIZE ];
    if( strlen( rnfrName ) == 0 || ! rnfrCmd ) {
      client.println(F("503 Need RNFR before RNTO") );
    } else if( haveParameter() && makePath( path ))
    {
      if( exists( path )) {
        client.print( F("553 ") ); client.print( parameter ); client.println( F(" already exists") );
      } else
      {
        strcpy( dirp, path );
        char * psep = strrchr( dirp, '/' );
        bool fail = psep == NULL;
        if( ! fail )
        {
          if( psep == dirp )
            psep ++;
          * psep = 0;
//          fail = ! isDir( dirp );
//          if( fail ) {
//        	  client.print( F("550 \"") ); client.print( dirp ); client.println( F("\" is not directory") );
//          } else
//          {
        	  DEBUG_PRINT( F(" Renaming ") ); DEBUG_PRINT( rnfrName ); DEBUG_PRINT( F(" to ") ); DEBUG_PRINTLN( path );

            if( rename( rnfrName, path ))
              client.println(F("250 File successfully renamed or moved") );
            else
              fail = true;
//          }
        }
        if( fail )
          client.println(F("451 Rename/move failure") );
      }
    }
    rnfrCmd = false;
  }
  /*
  //
  //  SYST - System
  //
  else if( CommandIs( "SYST" ))
    FtpOutCli << F("215 MSDOS") << endl;
  */
  
  ///////////////////////////////////////
  //                                   //
  //   EXTENSIONS COMMANDS (RFC 3659)  //
  //                                   //
  ///////////////////////////////////////

  //
  //  MDTM && MFMT - File Modification Time (see RFC 3659)
  //
  else if( CommandIs( "MDTM" ) || CommandIs( "MFMT" ))
  {
    if( haveParameter())
    {
      char path[ FTP_CWD_SIZE ];
      char * fname = parameter;
      uint16_t year;
      uint8_t month, day, hour, minute, second, setTime;
      char dt[ 15 ];
      bool mdtm = CommandIs( "MDTM" );

      setTime = getDateTime( dt, & year, & month, & day, & hour, & minute, & second );
      // fname point to file name
      fname += setTime;
      if( strlen( fname ) <= 0 ) {
        client.println(F("501 No file name") );
      } else if( makeExistsPath( path, fname )) {
        if( setTime ) // set file modification time
        {
          if( timeStamp( path, year, month, day, hour, minute, second )) {
            client.print( F("213 ") ); client.println( dt );
          } else {
            client.println(F("550 Unable to modify time" ));
          }
        }
        else if( mdtm ) // get file modification time
        {
          uint16_t dat=0, tim=0;
          char dtStr[ 15 ];
          if( getFileModTime( path, &dat, &tim )) {
            client.print( F("213 ") ); client.println( makeDateTimeStr( dtStr, dat, tim ) );
          } else {
            client.println("550 Unable to retrieve time" );
          }
        }
      }
    }
  }
  //
  //  SIZE - Size of the file
  //
  else if( CommandIs( "SIZE" ))
  {
    char path[ FTP_CWD_SIZE ];
    if( haveParameter() && makeExistsPath( path )) {
      if( ! openFile( path, FTP_FILE_READ )) {
        client.print( F("450 Can't open ") ); client.println( parameter );
      } else
      {
        client.print( F("213 ") ); client.println( long( fileSize( file )) );
        file.close();
      }
    }
  }
  //
  //  SITE - System command
  //
  /*
  else if( CommandIs( "SITE" ))
  {
    if( ParameterIs( "FREE" ))
    {
      uint32_t capa = capacity();
      if(( capa >> 10 ) < 1000 ) { // less than 1 Giga
        client.print( F("200 ") ); client.print( free() ); client.print( F(" kB free of ") );
        client.print( capa ); client.println( F(" kB capacity") );
      }else {
    	  client.print( F("200 ") ); client.print( ( free() >> 10 ) ); client.print( F(" MB free of ") );
    	  client.print( ( capa >> 10 ) ); client.println( F(" MB capacity") );
      }
    }
    else {
    	client.print( F("500 Unknown SITE command ") ); client.println( parameter );
    }
  }
  */
  else if( CommandIs( "SITE" ))
{
    if( ParameterIs( "FREE" ))
    {
        uint32_t capa = capacity();
        if(( capa >> 10 ) < 1000 ) { // less than 1 Giga
            client.print( F("200 ") ); client.print( free() ); client.print( F(" kB free of ") );
            client.print( capa ); client.println( F(" kB capacity") );
        } else {
            client.print( F("200 ") ); client.print( ( free() >> 10 ) ); client.print( F(" MB free of ") );
            client.print( ( capa >> 10 ) ); client.println( F(" MB capacity") );
        }
    }
    else if( ParameterIs( "STORAGE SD" ))
    {
        FtpServer::setStorageType(STORAGE_SD);
        updateFileSystem();
        client.println(F("200 Storage type set to SD"));
    }
    else if( ParameterIs( "STORAGE FFAT" ))
    {
        setStorageType(STORAGE_FFAT);
        updateFileSystem();
        client.println(F("200 Storage type set to FFAT"));
    }
    else {
        client.print( F("500 Unknown SITE command ") ); client.println( parameter );
    }
}
  //
  //  Unrecognized commands ...
  //
  else
    client.println(F("500 Unknown command") );
  return true;
}

