mrdude2478/Waveshare-ESP32-S3-Touch-AMOLED-1.8v1-NSW-Payload-Injector/src/FtpServer.cpp
		DEBUG_PRINT( F("\t") );
		if (writeFilename) DEBUG_PRINTLN( fn );

	} else {
//			data.print( F("+r,s") );
//			DEBUG_PRINT(F("+r,s"));

		data->print( F("-rw-rw-r--\t1\t") );
		data->print( user );
		data->print( F("\t") );
		data->print( fz );
		data->print( F("\t") );

		DEBUG_PRINT( F("-rw-rw-r--\t1\t") );
		DEBUG_PRINT( user );
		DEBUG_PRINT( F("\t") );
		DEBUG_PRINT( fz );
		DEBUG_PRINT( F("\t") );

		data->print(time);
		DEBUG_PRINT(time);

		data->print( F("\t") );
		if (writeFilename) data->println( fn );

		DEBUG_PRINT( F("\t") );
		if (writeFilename) DEBUG_PRINTLN( fn );
	}

}

#if defined(ESP32) || defined(ESP8266) || defined(ARDUINO_ARCH_RP2040)
//
// Formats printable String from a time_t timestamp
//
String makeDateTimeStrList(time_t ft, bool dateContracted = false)
{
  String tmp;
  // a buffer with enough space for the formats
  char buf[25];
  char *b = buf;

  // break down the provided file time
  struct tm _tm;
  gmtime_r(&ft, &_tm);

  if (dateContracted)
  {
    // "%Y%m%d%H%M%S", e.g. "20200517123400"
    strftime(b, sizeof(buf), "%Y%m%d%H%M%S", &_tm);
  }
  else
  {
    // "%h %d %H:%M", e.g. "May 17 12:34" for file dates of the current year
    // "%h %d  %Y"  , e.g. "May 17  2019" for file dates of any other years

    // just convert both ways, select later what's to be shown
    // buf becomes "May 17  2019May 17 12:34"
    strftime(b, sizeof(buf), "%h %d %H:%M%h %d  %Y", &_tm);

    // check for a year != year from now
    int fileYear = _tm.tm_year;
    time_t nowTime = time(NULL);
    gmtime_r(&nowTime, &_tm);
    if (fileYear == _tm.tm_year)
    {
      // cut off 2nd half - year variant
      b[12] = '\0';
    }
    else
    {
      // skip 1st half - time variant
      b += 12;
    }
  }
  tmp = b;
  return tmp;
}

// https://files.stairways.com/other/ftp-list-specs-info.txt
void generateFileLine(FTP_CLIENT_NETWORK_CLASS* data, bool isDirectory, const char* fn, long fz, time_t time, const char* user, bool writeFilename = true) {
	generateFileLine(data, isDirectory, fn, fz, makeDateTimeStrList(time).c_str(), user, writeFilename);
}
#endif

bool FtpServer::doList() {
  if (!dataConnected()) {
#if STORAGE_TYPE != STORAGE_SPIFFS && STORAGE_TYPE != STORAGE_LITTLEFS && STORAGE_TYPE != STORAGE_SEEED_SD
    dir.close();
#endif
    return false;
  }

#if STORAGE_TYPE == STORAGE_SPIFFS
#if ESP8266
  if (dir.next())
#else
  FTP_FILE fileDir = dir.openNextFile();
  if (fileDir)
#endif
  {
#ifdef ESP8266
    String fn = dir.fileName();
    if (fn[0] == '/') fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) return doList();
    long fz = long(dir.fileSize());
    time_t time = dir.fileTime();
    generateFileLine(&data, false, fn.c_str(), fz, time, this->user);
#else
    long fz = long(fileDir.size());
    const char* fnC = fileDir.name();
    const char* fn = (fnC[0] == '/') ? &fnC[1] : fnC;
    if (shouldSkipFile(String(fn))) {
      fileDir.close();
      return doList();
    }
    time_t time = fileDir.getLastWrite();
    generateFileLine(&data, false, fn, fz, time, this->user);
#endif
    nbMatch++;
    return true;
  }

#elif STORAGE_TYPE == STORAGE_LITTLEFS || STORAGE_TYPE == STORAGE_SEEED_SD || STORAGE_TYPE == STORAGE_FFAT
#if defined(ESP8266) || defined(ARDUINO_ARCH_RP2040)
  if (dir.next())
#else
#if STORAGE_TYPE == STORAGE_SEEED_SD
  FTP_FILE fileDir = currentFS->open(dir.name());
  fileDir = dir.openNextFile();
#else
  FTP_FILE fileDir = dir.openNextFile();
#endif
  if (fileDir)
#endif
  {
#if defined(ESP8266) || defined(ARDUINO_ARCH_RP2040)
    String aza = dir.fileName();
    const char* fn = aza.c_str();
    if (shouldSkipFile(aza)) return doList();
    long fz = long(dir.fileSize());
    time_t time = dir.fileTime();
    generateFileLine(&data, dir.isDirectory(), fn, fz, time, this->user);
#elif STORAGE_TYPE == STORAGE_SEEED_SD
    const char* fnC = fileDir.name();
    const char* fn = (fnC[0] == '/') ? &fnC[1] : fnC;
    if (shouldSkipFile(String(fn))) {
      fileDir.close();
      return doList();
    }
    long fz = fileDir.size();
    time_t time = 0; // or use fixed
    generateFileLine(&data, fileDir.isDirectory(), fn, fz, time, this->user);
#else
    const char* fn = fileDir.name();
    if (shouldSkipFile(String(fn))) {
      fileDir.close();
      return doList();
    }
    long fz = fileDir.size();
    time_t time = fileDir.getLastWrite();
    generateFileLine(&data, fileDir.isDirectory(), fn, fz, time, this->user);
#endif
    nbMatch++;
    return true;
  }

#elif STORAGE_TYPE == STORAGE_SD || STORAGE_TYPE == STORAGE_SD_MMC
  FTP_FILE fileDir = dir.openNextFile();
  if (fileDir) {
    String fn = fileDir.name();
    if (fn[0] == '/') fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) {
      fileDir.close();
      return doList();
    }
    generateFileLine(&data, fileDir.isDirectory(), fn.c_str(), fileDir.size(), "Jan 01 00:00", this->user);
    nbMatch++;
    return true;
  }

#endif

  client.print(F("226 "));
  client.print(nbMatch);
  client.println(F(" matches total"));
#if STORAGE_TYPE != STORAGE_SPIFFS && STORAGE_TYPE != STORAGE_LITTLEFS && STORAGE_TYPE != STORAGE_SEEED_SD
  dir.close();
#endif
  data.stop();
  return false;
}

bool FtpServer::doMlsd() {
  if (!dataConnected()) {
#if STORAGE_TYPE != STORAGE_SPIFFS && STORAGE_TYPE != STORAGE_LITTLEFS && STORAGE_TYPE != STORAGE_SEEED_SD
    dir.close();
#endif
    DEBUG_PRINTLN(F("Not connected!!"));
    return false;
  }
  DEBUG_PRINTLN(F("Connected!!"));

#if STORAGE_TYPE == STORAGE_SPIFFS
#if ESP8266
  if (dir.next())
#else
  File fileDir = dir.openNextFile();
  if (fileDir)
#endif
  {
    char dtStr[15];
    struct tm* timeinfo;
#if ESP8266
    time_t time = dir.fileTime();
#else
    time_t time = fileDir.getLastWrite();
#endif
    timeinfo = localtime(&time);
    strftime(dtStr, 15, "%Y%m%d%H%M%S", timeinfo);

#if ESP8266
    String fn = dir.fileName();
    fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) return doMlsd();
    long fz = dir.fileSize();
#else
    String fn = fileDir.name();
    fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) {
      fileDir.close();
      return doMlsd();
    }
    long fz = fileDir.size();
#endif

    data.print(F("Type=file;Modify="));
    data.print(dtStr);
    data.print(F(";Size="));
    data.print(fz);
    data.print(F("; "));
    data.println(fn);

