mrdude2478/Waveshare-ESP32-S3-Touch-AMOLED-1.8v1-NSW-Payload-Injector/src/FtpServer.cpp
    nbMatch++;
    return true;
  }

#elif STORAGE_TYPE == STORAGE_LITTLEFS || STORAGE_TYPE == STORAGE_SEEED_SD || STORAGE_TYPE == STORAGE_FFAT
#if defined(ESP8266) || defined(ARDUINO_ARCH_RP2040)
  if (dir.next())
#else
#if STORAGE_TYPE == STORAGE_SEEED_SD
  File fileDir = currentFS->open(dir.name());
  fileDir = dir.openNextFile();
#else
  File fileDir = dir.openNextFile();
#endif
  if (fileDir)
#endif
  {
    char dtStr[15];
#if STORAGE_TYPE == STORAGE_SEEED_SD
    strcpy(dtStr, "19700101000000");
#else
#if defined(ESP8266) || defined(ARDUINO_ARCH_RP2040)
    time_t time = dir.fileTime();
#else
    time_t time = fileDir.getLastWrite();
#endif
    struct tm* timeinfo = localtime(&time);
    strftime(dtStr, 15, "%Y%m%d%H%M%S", timeinfo);
#endif

#if defined(ESP8266) || defined(ARDUINO_ARCH_RP2040)
    String fn = dir.fileName();
    if (shouldSkipFile(fn)) return doMlsd();
    long fz = dir.fileSize();
#elif STORAGE_TYPE == STORAGE_SEEED_SD
    String fn = fileDir.name();
    fn.remove(0, strlen(dir.name()));
    if (fn[0] == '/') fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) {
      fileDir.close();
      return doMlsd();
    }
    long fz = fileDir.size();
#else
    String fn = fileDir.name();
    fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) {
      fileDir.close();
      return doMlsd();
    }
    long fz = fileDir.size();
#endif

    data.print(F("Type="));
    data.print(fileDir.isDirectory() ? F("dir") : F("file"));
    data.print(F(";Modify="));
    data.print(dtStr);
    data.print(F(";Size="));
    data.print(fz);
    data.print(F("; "));
    data.println(fn);

    nbMatch++;
#if STORAGE_TYPE == STORAGE_SEEED_SD
    fileDir.close();
#endif
    return true;
  }

#elif STORAGE_TYPE == STORAGE_SD || STORAGE_TYPE == STORAGE_SD_MMC
  File fileDir = dir.openNextFile();
  if (fileDir) {
    String fn = fileDir.name();
    fn.remove(0, fn.lastIndexOf("/") + 1);
    if (shouldSkipFile(fn)) {
      fileDir.close();
      return doMlsd();
    }

    char dtStr[15];
    strcpy(dtStr, "19700101000000");

    data.print(F("Type="));
    data.print(fileDir.isDirectory() ? F("dir") : F("file"));
    data.print(F(";Modify="));
    data.print(dtStr);
    data.print(F(";Size="));
    data.print(fileDir.size());
    data.print(F("; "));
    data.println(fn);

    nbMatch++;
    return true;
  }

#endif

  client.print(F("226 "));
  client.print(nbMatch);
  client.println(F(" matches total"));
#if STORAGE_TYPE != STORAGE_SPIFFS && STORAGE_TYPE != STORAGE_LITTLEFS && STORAGE_TYPE != STORAGE_SEEED_SD
  dir.close();
#endif
  data.stop();
  return false;
}



void FtpServer::closeTransfer()
{
  uint32_t deltaT = (int32_t) ( millis() - millisBeginTrans );
  if( deltaT > 0 && bytesTransfered > 0 )
  {
	  DEBUG_PRINT( F(" Transfer completed in ") ); DEBUG_PRINT( deltaT ); DEBUG_PRINTLN( F(" ms, ") );
	  DEBUG_PRINT( bytesTransfered / deltaT ); DEBUG_PRINTLN( F(" kbytes/s") );

	  if (FtpServer::_transferCallback) {
		  FtpServer::_transferCallback(FTP_TRANSFER_STOP, getFileName(&file).c_str(), bytesTransfered);
	  }


    client.println(F("226-File successfully transferred") );
    client.print( F("226 ") ); client.print( deltaT ); client.print( F(" ms, ") );
    client.print( bytesTransfered / deltaT ); client.println( F(" kbytes/s") );
  }
  else
    client.println(F("226 File successfully transferred") );
  
  file.close();
  data.stop();
}

void FtpServer::abortTransfer()
{
  if( transferStage != FTP_Close )
  {
	  if (FtpServer::_transferCallback) {
		  FtpServer::_transferCallback(FTP_TRANSFER_ERROR, getFileName(&file).c_str(), bytesTransfered);
	  }

	  file.close();
#if STORAGE_TYPE != STORAGE_SPIFFS && STORAGE_TYPE != STORAGE_LITTLEFS && STORAGE_TYPE != STORAGE_SEEED_SD
    dir.close();
#endif
    client.println(F("426 Transfer aborted") );
    DEBUG_PRINTLN( F(" Transfer aborted!") );

    transferStage = FTP_Close;
  }
//  if( data.connected())
  data.stop(); 
  restartPos = 0; // Reset restart position on abort

}

// Read a char from client connected to ftp server
//
//  update cmdLine and command buffers, iCL and parameter pointers
//
//  return:
//    -2 if buffer cmdLine is full
//    -1 if line not completed
//     0 if empty line received
//    length of cmdLine (positive) if no empty line received 

int32_t FtpServer::readChar()
{
  int32_t rc = -1;

  if( client.available())
  {
    char c = client.read();
    DEBUG_PRINT("-");
    DEBUG_PRINT( c );

    if( c == '\\' )
      c = '/';
    if( c != '\r' ){
      if( c != '\n' )
      {
        if( iCL < FTP_CMD_SIZE )
          cmdLine[ iCL ++ ] = c;
        else
          rc = -2; //  Line too long
      }
      else
      {
        cmdLine[ iCL ] = 0;
        command[ 0 ] = 0;
        parameter = NULL;
        // empty line?
        if( iCL == 0 )
          rc = 0;
        else
        {
          rc = iCL;
          // search for space between command and parameter
          parameter = strchr( cmdLine, ' ' );
          if( parameter != NULL )
          {
            if( parameter - cmdLine > 4 )
              rc = -2; // Syntax error
            else
            {
              strncpy( command, cmdLine, parameter - cmdLine );
              command[ parameter - cmdLine ] = 0;
              while( * ( ++ parameter ) == ' ' )
                ;
            }
          }
          else if( strlen( cmdLine ) > 4 )
            rc = -2; // Syntax error.
          else
            strcpy( command, cmdLine );
          iCL = 0;
        }
      }
    }
    if( rc > 0 )
      for( uint8_t i = 0 ; i < strlen( command ); i ++ )
        command[ i ] = toupper( command[ i ] );
    if( rc == -2 )
    {
      iCL = 0;
      client.println(F("500 Syntax error"));
    }
  }
  return rc;
}

bool FtpServer::haveParameter()
{
  if( parameter != NULL && strlen( parameter ) > 0 )
    return true;
  client.println("501 No file name" );
  return false;  
}

int utf8_strlen(const String& str)
{
    int c,i,ix,q;
    for (q=0, i=0, ix=str.length(); i < ix; i++, q++)
    {
        c = (unsigned char) str[i];
        if      (c>=0   && c<=127) i+=0;
        else if ((c & 0xE0) == 0xC0) i+=1;
        else if ((c & 0xF0) == 0xE0) i+=2;
        else if ((c & 0xF8) == 0xF0) i+=3;
        //else if (($c & 0xFC) == 0xF8) i+=4; // 111110bb //byte 5, unnecessary in 4 byte UTF-8
        //else if (($c & 0xFE) == 0xFC) i+=5; // 1111110b //byte 6, unnecessary in 4 byte UTF-8
        else return 0;//invalid utf8
    }
    return q;
}

//// ****** UTF8-Decoder: convert UTF8-string to extended ASCII *******
//static byte c1;  // Last character buffer
//
//// Convert a single Character from UTF8 to Extended ASCII
//// Return "0" if a byte has to be ignored
//byte utf8ascii(byte ascii) {
//    if ( ascii<128 )   // Standard ASCII-set 0..0x7F handling
//    {   c1=0;
//        return( ascii );
//    }
//
//    // get previous input
//    byte last = c1;   // get last char
//    c1=ascii;         // remember actual character
//
//    switch (last)     // conversion depending on first UTF8-character
//    {   case 0xC2: return  (ascii);  break;
//        case 0xC3: return  (ascii | 0xC0);  break;
//        case 0x82: if(ascii==0xAC) return(0x80);       // special case Euro-symbol
//    }
//
//    return  (0);                                     // otherwise: return zero, if character has to be ignored
//}
//
//// convert String object from UTF8 String to Extended ASCII
//String utf8ascii(String s)
//{
//        String r="";
//        char c;
//        for (int i=0; i<s.length(); i++)
//        {
//                c = utf8ascii(s.charAt(i));
//                if (c!=0) r+=c;
//        }
//        return r;
//}
//
//// In Place conversion UTF8-string to Extended ASCII (ASCII is shorter!)
//void utf8ascii(char* s)
//{
//        int k=0;
//        char c;
//        for (int i=0; i<strlen(s); i++)
//        {
//                c = utf8ascii(s[i]);
//                if (c!=0)
//                        s[k++]=c;
//        }
//        s[k]=0;
//}
//
//int utf8_strlen(const String& str)
//{
//	String ascii = utf8ascii(str);
//	return ascii.length();
//}
// Make complete path/name from cwdName and param
//
// 3 possible cases: param can be absolute path, relative path or only the name
//
// parameter:
//   fullName : where to store the path/name
//
// return:
//    true, if done

