mrdude2478/Waveshare-ESP32-S3-Touch-AMOLED-1.8v1-NSW-Payload-Injector/src/FtpServer.cpp
bool FtpServer::makePath( char * fullName, char * param )
{
  if( param == NULL )
    param = parameter;
    
  // Root or empty?
  if( strcmp( param, "/" ) == 0 || strlen( param ) == 0 )
  {
    strcpy( fullName, "/" );
    return true;
  }

  // Usa workingDir per tenere conto dei ".." modificati
  char workingDir[FTP_CWD_SIZE];
  strcpy( workingDir, cwdName );

  // Processa eventuali sequenze iniziali "../" (incluso il caso di una sola "..")
  // Ad ogni iterazione viene rimosso un livello dalla workingDir
  while ( (strncmp(param, "../", 3) == 0) || (strcmp(param, "..") == 0) )
  {
    // Rimuovi la slash finale da workingDir se presente (salvaguardando la root)
    int len = strlen( workingDir );
    if (len > 1 && workingDir[len - 1] == '/')
      workingDir[len - 1] = '\0';

    // Trova l'ultima slash per individuare il livello superiore
    char *lastSlash = strrchr( workingDir, '/' );
    if (lastSlash != NULL)
    {
      // Se l'unica slash � quella iniziale, siamo alla root
      if (lastSlash == workingDir)
      {
        workingDir[1] = '\0';  // Rimani in "/"
      }
      else
      {
        *lastSlash = '\0';  // Rimuovi l'ultimo componente
      }
    }
    else
    {
      // Caso imprevisto: torna in root
      strcpy( workingDir, "/" );
    }

    // Avanza il puntatore nel parametro:
    // Se param � esattamente "..", salta quei 2 caratteri e interrompi il ciclo.
    if (strcmp(param, "..") == 0)
    {
      param += 2; // Salta ".."
      break;
    }
    else
    {
      // Altrimenti, param inizia con "../": salta i primi 3 caratteri.
      param += 3;
    }
  }

  // Gestione del prefisso "./"
  if( strncmp( param, "./", 2 ) == 0 )
  {
    param += 2; // Salta "./"
    // Se dopo "./" non c'� nulla, restituisce la workingDir aggiornata
    if (*param == '\0')
    {
      strcpy( fullName, workingDir );
      return true;
    }
  }

  // Se il percorso � relativo, concatenalo con workingDir (aggiornato dai "../")
  if( param[0] != '/' ) 
  {
    strcpy( fullName, workingDir );
    if( fullName[ strlen(fullName) - 1 ] != '/' )
      strncat( fullName, "/", FTP_CWD_SIZE );
    strncat( fullName, param, FTP_CWD_SIZE );
  }
  else
    strcpy( fullName, param );

  // Rimuovi una eventuale slash finale in eccesso (se non si tratta della root)
  uint16_t strl = strlen( fullName ) - 1;
  if( fullName[strl] == '/' && strl > 1 )
    fullName[strl] = '\0';

  if( strlen( fullName ) >= FTP_CWD_SIZE )
  {
    client.println(F("500 Command line too long"));
    return false;
  }

#ifdef UTF8_SUPPORT
  DEBUG_PRINT(F("utf8_strlen"));
  DEBUG_PRINTLN(utf8_strlen(fullName));
  if (utf8_strlen(fullName) >= FILENAME_LENGTH) {
      client.println(F("553 File name not allowed. Too long."));
      return false;
  }
#else
  for( uint8_t i = 0; i < strlen(fullName); i++ )
  {
    if( !legalChar( fullName[i] ) )
    {
      client.println(F("553 File name not allowed"));
      return false;
    }
  }
  if (strlen(fullName) >= FILENAME_LENGTH)
  {
      client.println(F("553 File name not allowed. Too long."));
      return false;
  }
#endif

  return true;
}

bool FtpServer::makeExistsPath( char * path, char * param )
{
	  DEBUG_PRINT( F(" CWD PATH: cwdName -> ") );
	  DEBUG_PRINT(cwdName );
	  DEBUG_PRINT( F(" - param ") );
	  DEBUG_PRINT(param );
	  DEBUG_PRINT( F(" - path ") );
	  DEBUG_PRINTLN(path );

  if( ! makePath( path, param ))
    return false;
  // RoSchmi
  //#if STORAGE_TYPE == STORAGE_SPIFFS || STORAGE_TYPE == STORAGE_SD
#if (STORAGE_TYPE == STORAGE_SPIFFS || STORAGE_TYPE == STORAGE_SD || STORAGE_TYPE == STORAGE_SD_MMC  || STORAGE_TYPE == STORAGE_SEEED_SD)
  if (strcmp(path, "/") == 0)  return true;
#endif
  DEBUG_PRINT("PATH --> ")
  DEBUG_PRINT(path)
  if( exists( path )) {
	  DEBUG_PRINTLN(" ...EXIST!")
    return true;
  }
  DEBUG_PRINTLN(" ...NOT EXIST!")
  client.print(F("550 ")); client.print( path ); client.println( F(" not found.") );
  return false;
}

// Calculate year, month, day, hour, minute and second
//   from first parameter sent by MDTM command (YYYYMMDDHHMMSS)
// Accept longer parameter YYYYMMDDHHMMSSmmm where mmm are milliseconds
//   but don't take in account additional digits
//
// parameters:
//   dt: 15 length string for 14 digits and terminator
//   pyear, pmonth, pday, phour, pminute and psecond: pointer of
//     variables where to store data
//
// return:
//    0 if parameter is not YYYYMMDDHHMMSS
//    length of parameter + space
//
// Date/time are expressed as a 14 digits long string
//   terminated by a space and followed by name of file

uint8_t FtpServer::getDateTime( char * dt, uint16_t * pyear, uint8_t * pmonth, uint8_t * pday,
                                uint8_t * phour, uint8_t * pminute, uint8_t * psecond )
{
  uint8_t i;
  dt[ 0 ] = 0;
  if( strlen( parameter ) < 15 ) //|| parameter[ 14 ] != ' ' )
    return 0;
  for( i = 0; i < 14; i ++ )
    if( ! isdigit( parameter[ i ]))
      return 0;
  for( i = 14; i < 18; i ++ )
    if( parameter[ i ] == ' ' )
      break;
    else if( ! isdigit( parameter[ i ]))
      return 0;
  if( i == 18 )
    return 0;
  i ++ ;
  
  strncpy( dt, parameter, 14 );
  dt[ 14 ] = 0;
  * psecond = atoi( dt + 12 ); 
  dt[ 12 ] = 0;
  * pminute = atoi( dt + 10 );
  dt[ 10 ] = 0;
  * phour = atoi( dt + 8 );
  dt[ 8 ] = 0;
  * pday = atoi( dt + 6 );
  dt[ 6 ] = 0 ;
  * pmonth = atoi( dt + 4 );
  dt[ 4 ] = 0 ;
  * pyear = atoi( dt );
  strncpy( dt, parameter, 14 );
  DEBUG_PRINT( F(" Modification time: ") ); DEBUG_PRINT( * pyear ); DEBUG_PRINT( F("/") ); DEBUG_PRINT( int(* pmonth) ); DEBUG_PRINT( F("/") ); DEBUG_PRINT( int(* pday) );
  DEBUG_PRINT( F(" ") ); DEBUG_PRINT( int(* phour) ); DEBUG_PRINT( F(":") ); DEBUG_PRINT( int(* pminute) ); DEBUG_PRINT( F(":") ); DEBUG_PRINT( int(* psecond) );
  DEBUG_PRINT( F(" of file: ") ); DEBUG_PRINTLN( (char *) ( parameter + i ) );

  return i;
}

// Create string YYYYMMDDHHMMSS from date and time
//
// parameters:
//    date, time 
//    tstr: where to store the string. Must be at least 15 characters long
//
// return:
//    pointer to tstr

char * FtpServer::makeDateTimeStr( char * tstr, uint16_t date, uint16_t time )
{
  sprintf( tstr, "%04u%02u%02u%02u%02u%02u",
           (( date & 0xFE00 ) >> 9 ) + 1980, ( date & 0x01E0 ) >> 5, date & 0x001F,
           ( time & 0xF800 ) >> 11, ( time & 0x07E0 ) >> 5, ( time & 0x001F ) << 1 );            
  return tstr;
}


uint32_t FtpServer::fileSize( FTP_FILE & file ) {
#if (STORAGE_TYPE == STORAGE_SDFAT2 || STORAGE_TYPE == STORAGE_SPIFFS || STORAGE_TYPE == STORAGE_LITTLEFS || STORAGE_TYPE == STORAGE_FFAT || STORAGE_TYPE == STORAGE_SD || STORAGE_TYPE == STORAGE_SD_MMC || STORAGE_TYPE == STORAGE_SEEED_SD)
	return file.size();
#else
	return file.fileSize();
#endif
}

#if (STORAGE_TYPE == STORAGE_SEEED_SD)
  bool FtpServer::openFile( char path[ FTP_CWD_SIZE ], int readTypeInt ){
		DEBUG_PRINT(F("File to open ") );
		DEBUG_PRINT( path );
		DEBUG_PRINT(F(" readType ") );
		DEBUG_PRINTLN(readTypeInt);

		if (readTypeInt == 0X01) {
			readTypeInt = FILE_READ;
		}else {
			readTypeInt = FILE_WRITE;
		}

		file = currentFS->open( path, readTypeInt );
		if (!file) { // && readTypeInt[0]==FILE_READ) {
			return false;
		}else{
			DEBUG_PRINTLN("TRUE");

